# Case-study №2
# Developers:   Petrov V.A. 60%
#               Udachev N.V. 40%
#               Kuleshov R.A. 40%

print('Выберите тип семьи:', '\n 1.', 'Один субъект', '2.', 'Супружеская пара', '3.', 'Родитель-одиночка')
type_family = input()
tax_deduction = int(input('Введите ссуму налогового вычета: '))

JAN = 'Январь'
FAB = 'Февраль'
MAR = 'Март'
APR = 'Апрель'
MAY = 'Май'
JUN = 'Июнь'
JUL = 'Июль'
AUG = 'Август'
SEP = 'Сентябрь'
OCT = 'Октябрь'
NOV = 'Ноябрь'
DEC = 'Декабрь'
name_month = [JAN, FAB, MAR, APR, MAY, JUN, JUL, AUG, SEP, OCT, NOV, DEC]
annual_income = 0
for month in range(12):
    print('{} {}:'.format('Доход за', name_month[month], end=''))
    income = float(input())
    annual_income += income

income = int(annual_income - tax_deduction)
if type_family == '1':
    if 0 < income <= 9075:
        tax = income * 0.1
    if 9076 <= income <= 36900:
        tax = 0.1 * 9075 + 0.15 * (income - 9075)
    if 36901 <= income <= 89350:
        tax = 0.1 * 9075 + 0.15 * (36900 - 9075) + 0.25 * (income - 36900)
    if 89351 <= income <= 186350:
        tax = 0.1 * 9075 + 0.15 * (36900 - 9075) + 0.25 * (89350-36900) + (income-89350)
    if 186351 <= income <= 405100:
        tax = 0.1 * 9075 + 0.15 * (36900-9075) + 0.25 * (89350-36900) + 0.28 * (186350-89350) + (income-186351)
    if 405101 <= income <= 406750:
        tax = 0.1 * 9075 + 0.15 * (36900-9075) + 0.25 * (89350-36900) + 0.28 * (186350-89350) + \
              0.33 * (405100-186350) + (income-405100)
    if 406751 <= income:
        tax = 0.1 * 9075 + 0.15 * (36900-9075) + 0.25 * (89350-36900) + 0.28 * (186350-89350) + \
              0.33 * (405100-186350) + 0.396 * (406750-405100)
elif type_family == '2':
    if 0 < income <= 18150:
        tax = 0.1 * income
    elif 18151 <= income <= 73800:
        tax = 0.1 * 18150 + 0.15 * (annual_income - 18150)
    elif 73801 <= income <= 148850:
        tax = 0.1 * 18150 + 0.15 * (73800 - 18150) + 0.25 * (annual_income - 73800)
    elif 148851 <= income <= 226850:
        tax = 0.1 * 18150 + 0.15 * (73800 - 18150) + 0.25 * (148850 - 73800) + 0.28 * (income - 148850)
    elif 226851 <= income <= 405100:
        tax = 0.1 * 18150 + 0.15 * (73800 - 18150) + 0.25 * (148850 - 73800) + 0.28 * (226850 - 148850) + \
              0.33 * (income - 186350)
    elif 405101 <= income <= 457600:
        tax = 0.1 * 18150 + 0.15 * (73800 - 18150) + 0.25 * (148850 - 73800) + 0.28 * (226850 - 148850) + \
              0.33 * (405100 - 226850) + 0.35 * (income - 405100)
    elif 457600 <= income:
        tax = 0.1 * 18150 + 0.15 * (73800 - 18150) + 0.25 * (148850 - 73800) + 0.28 * (226850 - 148850) + \
              0.33 * (405100 - 226850) + 0.35 * (457600 - 405100) + 0.396 * (income - 457600)
elif type_family == '3':
    if 0 < income <= 12950:
        tax = 0.1*income
    elif 12950 < income <= 49400:
        tax = 0.1*income + 0.15*(income - 12950)
    elif 49400 < income <= 127550:
        tax = 0.1*12950 + 0.15*(49400 - 12950) + 0.25*(income - 49400)
    elif 127550 < income <= 206600:
        tax = 0.1*12950 + 0.15*(49400 - 12950) + 0.25*(127550 - 49400) + 0.28*(income - 127550)
    elif 206600 < income <= 405100:
        tax = 0.1*12950 + 0.15*(49400 - 12950) + 0.25*(127550 - 49400) + 0.28*(206600 - 127550) + \
              0.33*(income - 206600)
    elif 405100 < income <= 432200:
        tax = 0.1*12950 + 0.15*(49400 - 12950) + 0.25*(127550 - 49400) + 0.28*(206600 - 127550) + \
              0.33*(405100 - 206600) + 0.35*(income - 405100)
    elif 432200 < income:
        tax = 0.1 * 12950 + 0.15 * (49400 - 12950) + 0.25 * (127550 - 49400) + 0.28 * (206600 - 127550) + \
              0.33 * (405100 - 206600) + 0.35 * (432200 - 405100) + 0.396*(income - 432200)

print('Сумма налога составляет: ', tax, '$')
